externalSolarLoad/constant/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


".*"
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.2; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.9 0.9);
        emissivity      (0.9 0.9);
    };
}
maxZ
{
    type        opaqueReflective;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        emissivity      (0.84 0.84);
        absorptivity    (0.06 0.06);

        wallRefractiveIndex 1.5;
    }
}
minZ
{
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.3 0.7);
        emissivity      (0.3 0.7);
    };
}


// ************************************************************************* //
